Revit 2016 API
LineLoad.Point Property
Returns the three dimensional location of one of the points for the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016.  Use StartPoint or EndPoint property instead.")]
public XYZ this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016.  Use StartPoint or EndPoint property instead.")> _
Public ReadOnly Property Point ( _
	index As Integer _
) As XYZ
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016.  Use StartPoint or EndPoint property instead.")]
public:
property XYZ^ Point[int index] {
	XYZ^ get (int index);
}
Parameters
index
Type: System.Int32
The index of the point to return.
Remarks
An index of 0 represents the start point and 1 represents the end point. The location of the point is measured in decimal feet.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace